---

C#Visual BasicVisual C++

Revit 2024 API
---
Reference..::..EqualTo Method
Reference Class See Also Send Feedback
---

Checks if given reference is equal to this reference.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018

# Syntax

C#
---

    public bool EqualTo(
    	Reference reference
    )

Visual Basic
---

    Public Function EqualTo ( _
    	reference As Reference _
    ) As Boolean

Visual C++
---

    public:
    bool EqualTo(
    	Reference^ reference
    )

#### Parameters

reference
    Type: Autodesk.Revit.DB..::..ReferenceAnother reference.

#### Return Value

Returns true if given reference is equal to this reference, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when argument is nullNothingnullptra null reference (Nothing in Visual Basic). |

# See Also

Reference Class

Autodesk.Revit.DB Namespace